badgeteam/why2025-firmware-ch32v203/src/application/main.c
// Tanmatsu coprocessor firmware
// Copyright Nicolai Electronics 2024

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "ch32v003fun.h"
#include "i2c_master.h"
#include "i2c_slave.h"
#include "keyboard.h"
#include "pmic.h"
#include "rtc.h"

// Board revision
#define HW_REV 2

// Firmware version
#define FW_VERSION 6

#define OVERRIDE_C6  false
#define HARDWARE_REV 1  // 1 for prototype 1, 2 for prototype 2

// Pins
const uint8_t pin_c6_enable = PB8;
const uint8_t pin_c6_boot = (HARDWARE_REV > 1 ? PD1 : PB9);
const uint8_t pin_display_backlight = PB4;   // Note: change PWM timer configuration too when changing this pin
const uint8_t pin_keyboard_backlight = PB3;  // Note: change PWM timer configuration too when changing this pin
const uint8_t pin_interrupt = PA0;
const uint8_t pin_sdcard_detect = PA15;
const uint8_t pin_headphone_detect = PB5;
const uint8_t pin_amplifier_enable = PD0;
// const uint8_t pin_power_out = PC13; // Output to power button (for powering on using the RTC alarm)
const uint8_t pin_sda = PB7;  // Uses hardware I2C peripheral
const uint8_t pin_scl = PB6;  // Uses hardware I2C peripheral

#if HARDWARE_REV > 1
const uint8_t pin_camera = PA11;
const uint8_t pin_power_in = PA12;  // Input from power button
const uint8_t pin_pm_sda = PB11;
const uint8_t pin_pm_scl = PB10;
#endif

// Configuration
const uint16_t timer2_pwm_cycle_width = 255;       // Amount of brightness steps for keyboard backlight
const uint16_t timer3_pwm_cycle_width = 255;       // Amount of brightness steps for display backlight
static const uint32_t keyboard_scan_interval = 1;  // milliseconds (per row)
static const uint32_t input_scan_interval = 50;    // milliseconds

// I2C registers

typedef enum {
    I2C_REG_FW_VERSION_0 = 0,  // LSB
    I2C_REG_FW_VERSION_1,      // MSB
    I2C_REG_KEYBOARD_0,
    I2C_REG_KEYBOARD_1,
    I2C_REG_KEYBOARD_2,
    I2C_REG_KEYBOARD_3,
    I2C_REG_KEYBOARD_4,
    I2C_REG_KEYBOARD_5,
    I2C_REG_KEYBOARD_6,
    I2C_REG_KEYBOARD_7,
    I2C_REG_KEYBOARD_8,
    I2C_REG_DISPLAY_BACKLIGHT,
    I2C_REG_KEYBOARD_BACKLIGHT,
    I2C_REG_INTERRUPT,
    I2C_REG_RESERVED_0,
    I2C_REG_INPUT,  // SD card detect (bit 0) & headphone detect (bit 1)
    I2C_REG_OUTPUT,
    I2C_REG_RADIO_CONTROL,
    I2C_REG_RTC_VALUE_0,  // LSB
    I2C_REG_RTC_VALUE_1,
    I2C_REG_RTC_VALUE_2,
    I2C_REG_RTC_VALUE_3,
    I2C_REG_BACKUP_0,
    I2C_REG_BACKUP_1,
    I2C_REG_BACKUP_2,
    I2C_REG_BACKUP_3,
    I2C_REG_BACKUP_4,
    I2C_REG_BACKUP_5,
    I2C_REG_BACKUP_6,
    I2C_REG_BACKUP_7,
    I2C_REG_BACKUP_8,
    I2C_REG_BACKUP_9,
    I2C_REG_BACKUP_10,
    I2C_REG_BACKUP_11,
    I2C_REG_BACKUP_12,
    I2C_REG_BACKUP_13,
    I2C_REG_BACKUP_14,
    I2C_REG_BACKUP_15,
    I2C_REG_BACKUP_16,
    I2C_REG_BACKUP_17,
    I2C_REG_BACKUP_18,
    I2C_REG_BACKUP_19,
    I2C_REG_BACKUP_20,
    I2C_REG_BACKUP_21,
    I2C_REG_BACKUP_22,
    I2C_REG_BACKUP_23,
    I2C_REG_BACKUP_24,
    I2C_REG_BACKUP_25,
    I2C_REG_BACKUP_26,
    I2C_REG_BACKUP_27,
    I2C_REG_BACKUP_28,
    I2C_REG_BACKUP_29,
    I2C_REG_BACKUP_30,
    I2C_REG_BACKUP_31,
    I2C_REG_BACKUP_32,
    I2C_REG_BACKUP_33,
    I2C_REG_BACKUP_34,
    I2C_REG_BACKUP_35,
    I2C_REG_BACKUP_36,
    I2C_REG_BACKUP_37,
    I2C_REG_BACKUP_38,
    I2C_REG_BACKUP_39,
    I2C_REG_BACKUP_40,
    I2C_REG_BACKUP_41,
    I2C_REG_BACKUP_42,
    I2C_REG_BACKUP_43,
    I2C_REG_BACKUP_44,
    I2C_REG_BACKUP_45,
    I2C_REG_BACKUP_46,
    I2C_REG_BACKUP_47,
    I2C_REG_BACKUP_48,
    I2C_REG_BACKUP_49,
    I2C_REG_BACKUP_50,
    I2C_REG_BACKUP_51,
    I2C_REG_BACKUP_52,
    I2C_REG_BACKUP_53,
    I2C_REG_BACKUP_54,
    I2C_REG_BACKUP_55,
    I2C_REG_BACKUP_56,
    I2C_REG_BACKUP_57,
    I2C_REG_BACKUP_58,
    I2C_REG_BACKUP_59,
    I2C_REG_BACKUP_60,
    I2C_REG_BACKUP_61,
    I2C_REG_BACKUP_62,
    I2C_REG_BACKUP_63,
    I2C_REG_BACKUP_64,
    I2C_REG_BACKUP_65,
    I2C_REG_BACKUP_66,
    I2C_REG_BACKUP_67,
    I2C_REG_BACKUP_68,
    I2C_REG_BACKUP_69,
    I2C_REG_BACKUP_70,
    I2C_REG_BACKUP_71,
    I2C_REG_BACKUP_72,
    I2C_REG_BACKUP_73,
    I2C_REG_BACKUP_74,
    I2C_REG_BACKUP_75,
    I2C_REG_BACKUP_76,
    I2C_REG_BACKUP_77,
    I2C_REG_BACKUP_78,
    I2C_REG_BACKUP_79,
    I2C_REG_BACKUP_80,
    I2C_REG_BACKUP_81,
    I2C_REG_BACKUP_82,
    I2C_REG_BACKUP_83,
    I2C_REG_PMIC_COMM_FAULT,
    I2C_REG_PMIC_FAULT,
    I2C_REG_PMIC_ADC_CONTROL,
    I2C_REG_PMIC_ADC_VBAT_0,   // LSB (value in mV)
    I2C_REG_PMIC_ADC_VBAT_1,   // MSB
    I2C_REG_PMIC_ADC_VSYS_0,   // LSB (value in mV)
    I2C_REG_PMIC_ADC_VSYS_1,   // MSB
    I2C_REG_PMIC_ADC_TS_0,     // LSB (In % of REGN)
    I2C_REG_PMIC_ADC_TS_1,     // MSB
    I2C_REG_PMIC_ADC_VBUS_0,   // LSB (value in mV)
    I2C_REG_PMIC_ADC_VBUS_1,   // MSB
    I2C_REG_PMIC_ADC_ICHGR_0,  // LSB (value in mA)
    I2C_REG_PMIC_ADC_ICHGR_1,  // MSB
    I2C_REG_PMIC_BATTERY_CONTROL,
    I2C_REG_PMIC_CHARGING_STATUS,
    I2C_REG_PMIC_OTG_CONTROL,
    I2C_REG_LAST,  // End of list marker
} i2c_register_t;

volatile uint8_t i2c_registers[I2C_REG_LAST];

// Interrupt flags
volatile bool keyboard_interrupt = false;
volatile bool input_interrupt = false;
volatile bool pmic_interrupt = false;

// PMIC flags
volatile bool pmic_adc_trigger = false;
volatile bool pmic_adc_continuous = false;
volatile bool pmic_force_disable_charging = false;

// Interrupts
void interrupt_update_reg(void) {
    i2c_registers[I2C_REG_INTERRUPT] =
        (keyboard_interrupt & 1) | ((input_interrupt & 1) << 1) | ((pmic_interrupt & 1) << 2);
}

void interrupt_set(bool keyboard, bool input, bool pmic) {
    if (keyboard) {
        keyboard_interrupt = true;
    }
    if (input) {
        input_interrupt = true;
    }
    if (pmic) {
        pmic_interrupt = true;
    }
    interrupt_update_reg();
}

void interrupt_clear(bool keyboard, bool input, bool pmic) {
    if (keyboard) {
        keyboard_interrupt = false;
    }
    if (input) {
        input_interrupt = false;
    }
    if (pmic) {
        pmic_interrupt = false;
    }
    interrupt_update_reg();
}

// Inputs
bool input_step() {
    static uint8_t previous_value = 0;

    uint8_t value = 0;
    value |= (!funDigitalRead(pin_sdcard_detect)) << 0;
    value |= funDigitalRead(pin_headphone_detect) << 1;

#if HARDWARE_REV > 1
    value |= (!funDigitalRead(pin_power_in)) << 2;
#endif

    i2c_registers[I2C_REG_INPUT] = value;

    bool changed = previous_value != value;
    previous_value = value;

    return changed;
}

// Timer 2: keyboard backlight PWM

void timer2_set(uint16_t value) {
    if (value > timer2_pwm_cycle_width) {
        value = timer2_pwm_cycle_width;
    }
    TIM2->CH2CVR = timer2_pwm_cycle_width - value;
    TIM2->SWEVGR |= TIM_UG;  // Apply
}

