badgeteam/why2025-firmware-ch32v203/src/application/main.c
void timer2_init() {
    RCC->APB1PCENR |= RCC_APB1Periph_TIM2;               // Enable clock for timer 2
    AFIO->PCFR1 |= AFIO_PCFR1_TIM2_REMAP_PARTIALREMAP1;  // Partial mapping (PB3 as channel 2)
    funPinMode(pin_keyboard_backlight, GPIO_Speed_10MHz | GPIO_CNF_OUT_PP_AF);

    // Reset timer 3 peripheral
    RCC->APB1PRSTR |= RCC_APB1Periph_TIM2;
    RCC->APB1PRSTR &= ~RCC_APB1Periph_TIM2;

    TIM2->PSC = 0x10;                      // Clock prescaler divider
    TIM2->ATRLR = timer2_pwm_cycle_width;  // Total PWM cycle width

    TIM2->CHCTLR1 |= TIM_OC2M_2 | TIM_OC2M_1 | TIM_OC2PE;  // Enable channel 2

    TIM2->CTLR1 |= TIM_ARPE;  // Enable auto-reload of preload

    TIM2->CCER |= TIM_CC2E | TIM_CC2P;  // Enable channel 2 output, positive polarity

    timer2_set(0);  // Load default target PWM dutycycle

    TIM2->CTLR1 |= TIM_CEN;  // Enable timer
}

// Timer 3: display backlight PWM

void timer3_set(uint16_t value) {
    if (value > timer3_pwm_cycle_width) {
        value = timer3_pwm_cycle_width;
    }
    TIM3->CH1CVR = timer3_pwm_cycle_width - value;
    TIM3->SWEVGR |= TIM_UG;  // Apply
}

void timer3_init() {
    RCC->APB1PCENR |= RCC_APB1Periph_TIM3;              // Enable clock for timer 3
    AFIO->PCFR1 |= AFIO_PCFR1_TIM3_REMAP_PARTIALREMAP;  // Partial mapping (PB4 as channel 1)
    funPinMode(pin_display_backlight, GPIO_Speed_10MHz | GPIO_CNF_OUT_PP_AF);

    // Reset timer 3 peripheral
    RCC->APB1PRSTR |= RCC_APB1Periph_TIM3;
    RCC->APB1PRSTR &= ~RCC_APB1Periph_TIM3;

    TIM3->PSC = 0x10;                      // Clock prescaler divider
    TIM3->ATRLR = timer3_pwm_cycle_width;  // Total PWM cycle width

    TIM3->CHCTLR1 |= TIM_OC1M_2 | TIM_OC1M_1 | TIM_OC1PE;  // Enable channel 1

    TIM3->CTLR1 |= TIM_ARPE;  // Enable auto-reload of preload

    TIM3->CCER |= TIM_CC1E | TIM_CC1P;  // Enable channel 1 output, positive polarity

    timer3_set(255);  // Load default target PWM dutycycle

    TIM3->CTLR1 |= TIM_CEN;  // Enable timer
}

void set_pmic_status(pmic_result_t pmic_result) {
    i2c_registers[I2C_REG_PMIC_COMM_FAULT] |= (pmic_result & 1);
    if (i2c_registers[I2C_REG_PMIC_COMM_FAULT] & 1) {
        // Latch bit 2 after a communication fault has occured
        // can be reset by writing to the I2C register from the host
        if ((i2c_registers[I2C_REG_PMIC_COMM_FAULT] >> 1) & 1) {
            // First communication fault, generate interrupt
            interrupt_set(false, false, true);
        }
        i2c_registers[I2C_REG_PMIC_COMM_FAULT] |= (1 << 1);
    }
}

// I2C write callback
void i2c_write_cb(uint8_t reg, uint8_t length) {
    static uint32_t new_rtc_value = 0;

    while (length > 0) {
        switch (reg) {
            case I2C_REG_DISPLAY_BACKLIGHT: {
                timer3_set(i2c_registers[I2C_REG_DISPLAY_BACKLIGHT]);
                break;
            }
            case I2C_REG_KEYBOARD_BACKLIGHT:
                timer2_set(i2c_registers[I2C_REG_KEYBOARD_BACKLIGHT]);
                break;
            case I2C_REG_OUTPUT:
                funDigitalWrite(pin_amplifier_enable, i2c_registers[I2C_REG_OUTPUT] & 1);
#if HARDWARE_REV > 1
                funDigitalWrite(pin_camera, i2c_registers[I2C_REG_OUTPUT] & 2);
#endif
                break;
            case I2C_REG_RADIO_CONTROL:
#if OVERRIDE_C6 == false  // Ignore radio control register if radio override is active
                funDigitalWrite(pin_c6_enable, ((i2c_registers[I2C_REG_RADIO_CONTROL] >> 0) & 1) ? FUN_HIGH : FUN_LOW);
                funDigitalWrite(pin_c6_boot, ((i2c_registers[I2C_REG_RADIO_CONTROL] >> 1) & 1) ? FUN_HIGH : FUN_LOW);
#endif
                break;
            case I2C_REG_RTC_VALUE_0:
                new_rtc_value &= 0xFFFFFF00;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_0];
                break;
            case I2C_REG_RTC_VALUE_1:
                new_rtc_value &= 0xFFFF00FF;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_1] << 8;
                break;
            case I2C_REG_RTC_VALUE_2:
                new_rtc_value &= 0xFF00FFFF;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_2] << 16;
                break;
            case I2C_REG_RTC_VALUE_3:
                new_rtc_value &= 0x00FFFFFF;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_3] << 24;
                rtc_set_counter(new_rtc_value);
                break;
            case I2C_REG_PMIC_ADC_CONTROL: {
                pmic_adc_trigger = i2c_registers[I2C_REG_PMIC_ADC_CONTROL] & 1;
                pmic_adc_continuous = (i2c_registers[I2C_REG_PMIC_ADC_CONTROL] & 2) >> 1;
                break;
            }
            case I2C_REG_PMIC_BATTERY_CONTROL:
                pmic_force_disable_charging = (i2c_registers[I2C_REG_PMIC_BATTERY_CONTROL] & (1 << 0)) & 1;
                break;
            case I2C_REG_PMIC_OTG_CONTROL:
                set_pmic_status(pmic_set_otg_enable(i2c_registers[I2C_REG_PMIC_OTG_CONTROL] & 1));
                break;
            default:
                if (reg >= I2C_REG_BACKUP_0 && reg <= I2C_REG_BACKUP_83) {
                    bkp_write_byte(reg - I2C_REG_BACKUP_0, i2c_registers[reg]);
                }
                break;
        }
        // Next register
        reg++;
        length--;
    }
}

// I2C read callback
void i2c_read_cb(uint8_t reg) {
    switch (reg) {
        case I2C_REG_KEYBOARD_0:
        case I2C_REG_KEYBOARD_1:
        case I2C_REG_KEYBOARD_2:
        case I2C_REG_KEYBOARD_3:
        case I2C_REG_KEYBOARD_4:
        case I2C_REG_KEYBOARD_5:
        case I2C_REG_KEYBOARD_6:
        case I2C_REG_KEYBOARD_7:
        case I2C_REG_KEYBOARD_8:
            interrupt_clear(true, false, false);  // Clear keyboard interrupt flag
            break;
        case I2C_REG_INPUT:
            interrupt_clear(false, true, false);  // Clear input interrupt flag
            break;
        case I2C_REG_INTERRUPT:
            interrupt_clear(true, true, true);  // Clear all interrupts flag
            break;
        case I2C_REG_PMIC_COMM_FAULT:
        case I2C_REG_PMIC_FAULT:
        case I2C_REG_PMIC_ADC_CONTROL:
        case I2C_REG_PMIC_ADC_VBAT_0:
        case I2C_REG_PMIC_ADC_VBAT_1:
        case I2C_REG_PMIC_ADC_VSYS_0:
        case I2C_REG_PMIC_ADC_VSYS_1:
        case I2C_REG_PMIC_ADC_TS_0:
        case I2C_REG_PMIC_ADC_TS_1:
        case I2C_REG_PMIC_ADC_VBUS_0:
        case I2C_REG_PMIC_ADC_VBUS_1:
        case I2C_REG_PMIC_ADC_ICHGR_0:
        case I2C_REG_PMIC_ADC_ICHGR_1:
            interrupt_clear(false, false, true);  // Clear PMIC interrupt flag
            break;
        default:
            break;
    }
}

void bkp_read_all(void) {
    for (uint8_t index = 0; index < 42; index++) {
        uint16_t value = bkp_read(index);
        i2c_registers[I2C_REG_BACKUP_0 + index * 2 + 0] = (value >> 0) & 0xFF;
        i2c_registers[I2C_REG_BACKUP_0 + index * 2 + 1] = (value >> 8) & 0xFF;
    }
}

void pmic_task(void) {
    // Periodic task for controlling PMIC
    static uint8_t empty_battery_delay = 4;
    static bool prev_adc_contiuous = false;
    static bool adc_active = false;
    static bool prev_vbus_attached = false;
    static bool vbus_attached = false;
    static bool battery_attached = false;
    static bool prev_force_disable_charging = false;

    pmic_result_t res;

    // Fault reporting
    uint8_t raw_faults = 0;
    pmic_faults_t faults = {0};
    res = pmic_get_faults(&raw_faults, &faults);
    set_pmic_status(res);
    if (res != pmic_ok) return;  // Stop on communication error
    uint8_t prev_raw_faults = i2c_registers[I2C_REG_PMIC_FAULT];
    i2c_registers[I2C_REG_PMIC_FAULT] = raw_faults;
    if (prev_raw_faults != raw_faults) {
        interrupt_set(false, false, true);
    }

