badgeteam/why2025-firmware-ch32v203/src/application/main.c
    // ADC: process previous conversion
    if (adc_active || pmic_adc_continuous) {
        uint16_t adc_vbat = 0;
        res = pmic_get_adc_vbat(&adc_vbat, NULL);
        if (res != pmic_ok) {
            set_pmic_status(res);
            return;  // Stop on communication error
        }

        uint16_t adc_vsys = 0;
        res = pmic_get_adc_vsys(&adc_vsys);
        if (res != pmic_ok) {
            set_pmic_status(res);
            return;  // Stop on communication error
        }

        uint16_t adc_tspct = 0;
        res = pmic_get_adc_tspct(&adc_tspct);
        if (res != pmic_ok) {
            set_pmic_status(res);
            return;  // Stop on communication error
        }

        // uint16_t adc_vbus = 0;
        // res = pmic_get_adc_vbus(&adc_vbus, NULL);
        // if (res != pmic_ok) {
        //    set_pmic_status(res);
        //    return;  // Stop on communication error
        //}

        uint16_t adc_ichgr = 0;
        res = pmic_get_adc_ichgr(&adc_ichgr);
        if (res != pmic_ok) {
            set_pmic_status(res);
            return;  // Stop on communication error
        }

        LockI2CSlave(true);
        i2c_registers[I2C_REG_PMIC_ADC_VBAT_0] = adc_vbat & 0xFF;
        i2c_registers[I2C_REG_PMIC_ADC_VBAT_1] = (adc_vbat >> 8) & 0xFF;
        i2c_registers[I2C_REG_PMIC_ADC_VSYS_0] = adc_vsys & 0xFF;
        i2c_registers[I2C_REG_PMIC_ADC_VSYS_1] = (adc_vsys >> 8) & 0xFF;
        i2c_registers[I2C_REG_PMIC_ADC_TS_0] = adc_tspct & 0xFF;
        i2c_registers[I2C_REG_PMIC_ADC_TS_1] = (adc_tspct >> 8) & 0xFF;
        // i2c_registers[I2C_REG_PMIC_ADC_VBUS_0] = adc_vbus & 0xFF;
        // i2c_registers[I2C_REG_PMIC_ADC_VBUS_1] = (adc_vbus >> 8) & 0xFF;
        i2c_registers[I2C_REG_PMIC_ADC_ICHGR_0] = adc_ichgr & 0xFF;
        i2c_registers[I2C_REG_PMIC_ADC_ICHGR_1] = (adc_ichgr >> 8) & 0xFF;
        LockI2CSlave(false);

        if (adc_active) {
            interrupt_set(false, false, true);
        }

        adc_active = false;
    }

    // ADC: trigger new conversion
    if (pmic_adc_trigger || prev_adc_contiuous != pmic_adc_continuous) {
        res = pmic_set_adc_configuration(pmic_adc_trigger, prev_adc_contiuous);
        if (res != pmic_ok) {
            set_pmic_status(res);
            return;  // Stop on communication error
        }

        pmic_adc_trigger = 0;
        prev_adc_contiuous = pmic_adc_continuous;

        adc_active = true;
        i2c_registers[I2C_REG_PMIC_ADC_CONTROL] &= ~(1 << 0);  // Clear the trigger bit
    }

    // Battery detection
    if (empty_battery_delay > 0) {
        empty_battery_delay -= 1;
        if (empty_battery_delay == 0) {
            prev_vbus_attached = false;  // Force redetect
        }
    }

    uint16_t adc_vbus = 0;
    pmic_get_adc_vbus(&adc_vbus, &vbus_attached);
    LockI2CSlave(true);
    i2c_registers[I2C_REG_PMIC_ADC_VBUS_0] = adc_vbus & 0xFF;
    i2c_registers[I2C_REG_PMIC_ADC_VBUS_1] = (adc_vbus >> 8) & 0xFF;
    LockI2CSlave(false);
    if (pmic_force_disable_charging) {
        // Charging has been disabled by user
        if (!prev_force_disable_charging) {
            res = pmic_configure_battery_charger(false);
        }
        prev_force_disable_charging = pmic_force_disable_charging;
    } else {
        if (!prev_vbus_attached && vbus_attached) {
            //   Badge has been connected to USB supply
            pmic_battery_attached(&battery_attached, empty_battery_delay == 0);
            pmic_configure_battery_charger(battery_attached);
        } else if (prev_vbus_attached && !vbus_attached) {
            // Badge has been disconnected from USB supply
            pmic_configure_battery_charger(false);  // Disable battery charging
        }
    }
    prev_vbus_attached = vbus_attached;

    uint8_t charging_status = 0;
    if (battery_attached) {
        charging_status |= (1 << 0);  // Bit 0: battery attached
    }
    if (vbus_attached) {
        charging_status |= (1 << 1);  // Bit 1: power input attached
    }
    if (pmic_force_disable_charging) {
        charging_status |= (1 << 2);  // Bit 12: charging disabled by user
    }
    i2c_registers[I2C_REG_PMIC_CHARGING_STATUS] = charging_status;
}

// Entry point
int main() {
    SystemInit();
    funGpioInitAll();

    // Initialize keyboard
    keyboard_init();

    // Initialize I2C slave
    funPinMode(pin_sda, GPIO_CFGLR_OUT_10Mhz_AF_OD);  // SDA
    funPinMode(pin_scl, GPIO_CFGLR_OUT_10Mhz_AF_OD);  // SCL
    SetupI2CSlave(0x5f, i2c_registers, sizeof(i2c_registers), i2c_write_cb, i2c_read_cb, false);

    // Initialize I2C master
#if HARDWARE_REV > 1
    funPinMode(pin_pm_sda, GPIO_CFGLR_OUT_10Mhz_AF_OD);  // SDA
    funPinMode(pin_pm_scl, GPIO_CFGLR_OUT_10Mhz_AF_OD);  // SCL
    SetupI2CMaster();

    // Disable PMIC I2C watchdog
    pmic_get_watchdog_timer_limit(0);

    // Connect battery if previously disabled
    pmic_set_battery_disconnect_enable(false);

    // Configure USB power input
    pmic_set_input_current_limit(2048, true, false);  // Allow up to 2048mA to be sourced from the USB-C port
    pmic_set_input_current_optimizer(true);  // Check input voltage and reduce current if supply insufficient for 2048mA

    // Configure other stuff
    pmic_set_battery_load_enable(false);          // Disable 30mA load on battery
    pmic_set_minimum_system_voltage_limit(3500);  // 3.5v (default)
    pmic_set_adc_configuration(false, false);     // Disable continuous ADC mode

    // Configure battery charger
    pmic_set_charge_enable(false);                           // Disable battery charging
    pmic_set_pumpx_enable(false);                            // Disable current pulse control
    pmic_set_charge_voltage_limit(4208);                     // Charge to 4.2v
    pmic_set_charge_current_fast(2048);                      // Charge with 2A maximum
    pmic_set_charge_battery_precharge_threshold_3v(true);    // Switch from precharge to fast charge at 3v
    pmic_set_charge_recharge_threshold_200mv_offset(false);  // Recharge when battery voltage is 100mV below target

    pmic_set_otg_enable(true);  // Enable OTG booster (for testing)
#endif

    // ESP32-C6
    funPinMode(pin_c6_enable, GPIO_Speed_10MHz | GPIO_CNF_OUT_PP);
    funDigitalWrite(pin_c6_enable, FUN_LOW);
    funPinMode(pin_c6_boot, GPIO_Speed_10MHz | GPIO_CNF_OUT_OD);
    funDigitalWrite(pin_c6_boot, FUN_HIGH);

#if OVERRIDE_C6
    funDigitalWrite(pin_c6_enable, FUN_HIGH);  // Turn on radio
#endif

    // Display backlight
    timer3_init();  // Use timer 3 channel 1 as PWM output for controlling display backlight

    // Keyboard backlight
    timer2_init();  // Use timer 2 channel 2 as PWM output for controlling keyboard backlight

    // Interrupt
    funPinMode(pin_interrupt, GPIO_Speed_10MHz | GPIO_CNF_OUT_OD);
    funDigitalWrite(pin_interrupt, FUN_HIGH);

    // SD card detect
    funPinMode(pin_sdcard_detect, GPIO_Speed_In | GPIO_CNF_IN_FLOATING);

