badgeteam/why2025-firmware-ch32v203/src/application/main.c
    // Headphone detect
    funPinMode(pin_headphone_detect, GPIO_Speed_In | GPIO_CNF_IN_FLOATING);

    // Amplifier enable
    AFIO->PCFR1 |= AFIO_PCFR1_PD01_REMAP;

    funPinMode(pin_amplifier_enable, GPIO_Speed_10MHz | GPIO_CNF_OUT_PP);
    funDigitalWrite(pin_amplifier_enable, FUN_LOW);

    // Real time clock
    rtc_init();

    // Backup registers
    bkp_read_all();

#if HARDWARE_REV > 1
    bool power_button_latch = false;
    uint8_t power_button_counter = 0;
#endif

    while (1) {
        i2c_registers[I2C_REG_FW_VERSION_0] = (FW_VERSION) & 0xFF;
        i2c_registers[I2C_REG_FW_VERSION_1] = (FW_VERSION >> 8) & 0xFF;

        uint32_t now = SysTick->CNT;

        static uint32_t keyboard_scan_previous = 0;
        if (now - keyboard_scan_previous >= keyboard_scan_interval * DELAY_MS_TIME) {
            keyboard_scan_previous = now;
            bool set_keyboard_interrupt =
                keyboard_step(&i2c_registers[I2C_REG_KEYBOARD_0]);  // Scans one row when called
            if (set_keyboard_interrupt) {
                interrupt_set(true, false, false);
            }
        }

        static uint32_t input_scan_previous = 0;
        if (now - input_scan_previous >= input_scan_interval * DELAY_MS_TIME) {
            input_scan_previous = now;
            bool set_input_interrupt = input_step();  // Scans all inputs
            if (set_input_interrupt) {
                interrupt_set(false, true, false);
            }

#if HARDWARE_REV > 1
            if (!funDigitalRead(pin_power_in)) {
                if (power_button_latch && power_button_counter > 500 / input_scan_interval) {
                    pmic_power_off();
                }
                power_button_counter++;
            } else {
                power_button_latch = true;
                power_button_counter = 0;
            }
#endif
        }

        static uint32_t rtc_previous = 0;
        if (now - rtc_previous >= 1 * DELAY_MS_TIME) {
            rtc_previous = now;
            uint32_t value = rtc_get_counter();
            LockI2CSlave(true);
            i2c_registers[I2C_REG_RTC_VALUE_0] = (value >> 0) & 0xFF;
            i2c_registers[I2C_REG_RTC_VALUE_1] = (value >> 8) & 0xFF;
            i2c_registers[I2C_REG_RTC_VALUE_2] = (value >> 16) & 0xFF;
            i2c_registers[I2C_REG_RTC_VALUE_3] = (value >> 24) & 0xFF;
            LockI2CSlave(false);
        }

        /*static uint32_t bl_previous = 0;
        if (now - bl_previous >= 20 * DELAY_MS_TIME) {
            bl_previous = now;
            if (backlight_fade_value < timer3_pwm_cycle_width) {
                timer3_set(backlight_fade_value);
                backlight_fade_value++;
            }
        }*/

#if HARDWARE_REV > 1
        static uint32_t pmic_previous = 0;
        if (now - pmic_previous >= 500 * DELAY_MS_TIME) {
            pmic_previous = now;
            pmic_task();
        }
#endif

        funDigitalWrite(pin_interrupt,
                        (keyboard_interrupt | input_interrupt | pmic_interrupt)
                            ? FUN_LOW
                            : FUN_HIGH);  // Update interrupt pin state
    }
}
